Revit 2027 API
EnergyAnalysisSpace.CADObjectUniqueId Property
 The unique id of the originating Element associated with this EnergyAnalysisSpace at the time of EAM creation.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string CADObjectUniqueId { get; }
Public ReadOnly Property CADObjectUniqueId As String
	Get
public:
property String^ CADObjectUniqueId {
	String^ get ();
}
member CADObjectUniqueId : string with get
Property Value
String
Remarks
 This unique id can be passed to the Document.GetElement(string) method. This EnergyAnalysisSpace may have been created form Autodesk.Revit.DB.Architecture.Room, or Autodesk.Revit.DB.Mechanical.Space elements. If this EnergyAnalysisSpace was not created from a room or a space the CADObjectUniqueId will be the same as EnergyAnalysisSpace.UniqueId. CADObjectUniqueId is unrelated to the CADObjectId element in gbxml.
See Also
Reference
EnergyAnalysisSpace Class
Autodesk.Revit.DB.Analysis Namespace